DataProcessors/НастройкиGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>НастройкиGoogle</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВариантыНастроекГуглСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВариантыНастроекГуглСервисов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ClientID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ClientSecret</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>code</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>access_token</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>refresh_token</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаПолученияТокена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>expires_in</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/НастройкиGoogle/Forms/ФормаАвторизации/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтрокаHTMLДокументСформирован(Элемент)
	
	URL = Элементы.СтрокаHTML.Документ.URL;
	
	Если СтрНайти(URL, "code=") Тогда
		code = Сред(URL, Найти(URL, "=") + 1);
		code = Сред(code, 0, Найти(code, "scope") - 1);
		ЗаписатьНастройкуНаСервере(code);
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуНаСервере(code)
	
	РегистрыСведений.НастройкиПодключенияГуглСервисов.ЗаписатьЗначениеНастройки(Перечисления.ВариантыНастроекГуглСервисов.code, code);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокНастроек = РегистрыСведений.НастройкиПодключенияГуглСервисов.ПолучитьСписокНастроек();
	
	ПараметрыЗапроса = "response_type=code"+"&";
	ПараметрыЗапроса = ПараметрыЗапроса + "client_id="+ СписокНастроек[ПредопределенноеЗначение("Перечисление.ВариантыНастроекГуглСервисов.ClientID")] + "&";
	ПараметрыЗапроса = ПараметрыЗапроса + "redirect_uri=http://localhost&";
	ПараметрыЗапроса = ПараметрыЗапроса + "&access_type=offline" + "&";
	ПараметрыЗапроса = ПараметрыЗапроса + "&approval_prompt=force" + "&";
	
	ПараметрыЗапроса = ПараметрыЗапроса + "scope=https://www.googleapis.com/auth/tasks https://www.googleapis.com/auth/calendar https://www.googleapis.com/auth/calendar.events";
	АдресАвторизации = "https://accounts.google.com/o/oauth2/auth" + "?";
	ПолныйАдресАвторизации = АдресАвторизации + ПараметрыЗапроса;
	СтрокаHTML = ПолныйАдресАвторизации;
	КонецПроцедуры
//['https://www.googleapis.com/auth/analytics.readonly']
